stress-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 50
      name: "Rampa para encontrar el limite del servidor"
scenarios:
  - name: "Consultar mesas disponibles"
    flow:
      - get:
          url: "/api/mesas"
  - name: "Consultar metricas de dashboard"
    flow:
      - get:
          url: "/api/admin/metrics"